In [1]:
import numpy as np
import pandas as pd

In [13]:
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],}

data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'],
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']}

df = pd.DataFrame(data1)

df1 = pd.DataFrame(data2)

In [15]:
pd.merge(df, df1)

  key    Name  Age    Address Qualification
0  K0     Jai   27     Nagpur         Btech
1  K1  Princi   24     Kanpur           B.A
2  K2  Gaurav   22  Allahabad          Bcom
3  K3    Anuj   32    Kannuaj        B.hons

In [16]:
df

  key    Name  Age
0  K0     Jai   27
1  K1  Princi   24
2  K2  Gaurav   22
3  K3    Anuj   32

In [17]:
df1

  key    Address Qualification
0  K0     Nagpur         Btech
1  K1     Kanpur           B.A
2  K2  Allahabad          Bcom
3  K3    Kannuaj        B.hons

In [20]:
pd.concat([df, df1])

  key    Name   Age    Address Qualification
0  K0     Jai  27.0        NaN           NaN
1  K1  Princi  24.0        NaN           NaN
2  K2  Gaurav  22.0        NaN           NaN
3  K3    Anuj  32.0        NaN           NaN
0  K0     NaN   NaN     Nagpur         Btech
1  K1     NaN   NaN     Kanpur           B.A
2  K2     NaN   NaN  Allahabad          Bcom
3  K3     NaN   NaN    Kannuaj        B.hons